DotBots/DotBot-firmware/bsp/nrf52833/lh2.c
///! NOTE: SPIM needs an SCK pin to be defined, P1.6 is used because it's not an available pin in the BCM module
static const gpio_t _lh2_spi_fake_sck_gpio = {
    .port = 1,
    .pin  = 6,
};

static lh2_vars_t _lh2_vars;  ///< local data of the LH2 driver

//=========================== prototypes =======================================

// these functions are called in the order written to perform the LH2 localization
/**
 * @brief wiggle the data and envelope lines in a magical way to configure the TS4231 to continuously read for LH2 sweep signals.
 *
 * @param[in]   gpio_d  pointer to gpio data
 * @param[in]   gpio_e  pointer to gpio event
 */
void _initialize_ts4231(const gpio_t *gpio_d, const gpio_t *gpio_e);

/**
 * @brief
 * @param sample_buffer: SPI samples loaded into a local buffer
 * @return chipsH: 64-bits of demodulated data
 */
uint64_t _demodulate_light(uint8_t *sample_buffer);

/**
 * @brief from a 17-bit sequence and a polynomial, generate up to 64-17=47 bits as if the LFSR specified by poly were run forwards for numbits cycles, all little endian
 *
 * @param poly: 17-bit polynomial
 * @param bits_in: starting seed
 * @param numbits: number of bits
 *
 * @return sequence of bits resulting from running the LFSR forward
 */
uint64_t _poly_check(uint32_t poly, uint32_t bits, uint8_t numbits);

/**
 * @brief find out which LFSR polynomial the bit sequence is a member of
 *
 * @param[in] chipsH1: input sequences of bits from demodulation
 * @param[in] start_val: number of bits between the envelope falling edge and the beginning of the sequence where valid data has been found
 *
 * @return polynomial, indicating which polynomial was found, or FF for error (polynomial not found).
 */
uint8_t _determine_polynomial(uint64_t chipsH1, int8_t *start_val);

/**
 * @brief counts the number of 1s in a 64-bit
 *
 * @param bits_in, arbitrary bits
 *
 * @return cumulative number of 1s inside of bits_in
 */
uint64_t _hamming_weight(uint64_t bits_in);

/**
 * @brief finds the position of a 17-bit sequence (bits) in the sequence generated by polynomial3 with initial seed 1
 *
 * @param bits: 17-bit sequence
 *
 * @return count: location of the sequence
 */
uint32_t _reverse_count_p(uint8_t index, uint32_t bits);

/**
 * @brief Set a gpio as an INPUT with no pull-up or pull-down
 * @param[in] gpio: pin to configure as input [0-31]
 */
void _lh2_pin_set_input(const gpio_t *gpio);

/**
 * @brief Set a gpio as an OUTPUT with standard drive
 * @param[in] gpio: gpio to configure as input [0-31]
 */
void _lh2_pin_set_output(const gpio_t *gpio);

/**
 * @brief set-up GPIOTE so that events are configured for falling (GPIOTE_CH_IN) and rising edges (GPIOTE_CH_IN_ENV_HiToLo) of the envelope signal
 *
 * @param[in]   gpio_e  pointer to gpio event
 */
void _gpiote_setup(const gpio_t *gpio_e);

/**
 * @brief start SPI3 at falling edge of envelope, start timer2 at falling edge of envelope, stop/capture timer2 at rising edge of envelope
 */
void _ppi_setup(void);

/**
 * @brief spi3 setup
 *
 * @param[in]   gpio_d  pointer to gpio data
 */
void _spi3_setup(const gpio_t *gpio_d);

/**
 * @brief timer2 setup, in _ppi_setup() this timer will CLEAR/START at falling edge of envelop signal and STOP/CAPTURE at rising edge of envelope signal
 */
void _timer2_setup(void);

//=========================== public ===========================================

void db_lh2_init(db_lh2_t *lh2, const gpio_t *gpio_d, const gpio_t *gpio_e) {
    // Initialize the TS4231 on power-up - this is only necessary when power-cycling
    _initialize_ts4231(gpio_d, gpio_e);

    // Configure the necessary Pins in the GPIO peripheral  (MOSI and CS not needed)
    _lh2_pin_set_input(gpio_d);                    // Data_pin will become the MISO pin
    _lh2_pin_set_output(&_lh2_spi_fake_sck_gpio);  // set SCK as Output.

    _spi3_setup(gpio_d);

    // Setup the LH2 local variables
    memset(_lh2_vars.spi_rx_buffer, 0, SPI3_BUFFER_SIZE);
    _lh2_vars.transfer_counter   = 0;
    _lh2_vars.lha_packet_counter = 0;
    _lh2_vars.lhb_packet_counter = 0;
    _lh2_vars.buffers_ready      = false;

    // Setup LH2 data
    for (uint8_t location = 0; location < LH2_LOCATIONS_COUNT; location++) {
        lh2->raw_data[location].bits_sweep           = 0;
        lh2->raw_data[location].selected_polynomial  = LH2_POLYNOMIAL_ERROR_INDICATOR;
        lh2->raw_data[location].bit_offset           = 0;
        lh2->locations[location].selected_polynomial = LH2_POLYNOMIAL_ERROR_INDICATOR;
        lh2->locations[location].lfsr_location       = LH2_LOCATION_ERROR_INDICATOR;
        _lh2_vars.data[location].envelope_duration   = 0xFFFFFFFF;
        memset(_lh2_vars.data[location].buffer, 0, LH2_BUFFER_SIZE);
    }

    // initialize GPIOTEs
    _gpiote_setup(gpio_e);
    // initialize timer(s)
    _timer2_setup();
    // initialize PPI
    _ppi_setup();

    lh2->state = DB_LH2_IDLE;
}

void db_lh2_start(db_lh2_t *lh2) {
    db_lh2_reset(lh2);
    NRF_PPI->CHENSET = (PPI_CHENSET_CH2_Enabled << PPI_CHENSET_CH2_Pos) |
                       //(PPI_CHENSET_CH3_Enabled << PPI_CHENSET_CH3_Pos);
                       (PPI_CHENSET_CH4_Enabled << PPI_CHENSET_CH4_Pos) |
                       (PPI_CHENSET_CH5_Enabled << PPI_CHENSET_CH5_Pos);
    lh2->state = DB_LH2_RUNNING;
}

void db_lh2_stop(db_lh2_t *lh2) {
    NRF_PPI->CHENCLR = (PPI_CHENSET_CH2_Enabled << PPI_CHENSET_CH2_Pos) |
                       //(PPI_CHENSET_CH3_Enabled << PPI_CHENSET_CH3_Pos);
                       (PPI_CHENSET_CH4_Enabled << PPI_CHENSET_CH4_Pos) |
                       (PPI_CHENSET_CH5_Enabled << PPI_CHENSET_CH5_Pos);
    lh2->state = DB_LH2_IDLE;
}

void db_lh2_reset(db_lh2_t *lh2) {
    _lh2_vars.transfer_counter   = 0;
    _lh2_vars.lha_packet_counter = 0;
    _lh2_vars.lhb_packet_counter = 0;
    _lh2_vars.buffers_ready      = false;
    lh2->state                   = DB_LH2_RUNNING;
}

void db_lh2_process_raw_data(db_lh2_t *lh2) {
    if (!_lh2_vars.buffers_ready) {
        return;
    }

    for (uint8_t location = 0; location < LH2_LOCATIONS_COUNT; location++) {
        lh2->raw_data[location].bits_sweep = 0;
        // perform the demodulation + poly search on the received packets
        // convert the SPI reading to bits via zero-crossing counter demodulation and differential/biphasic manchester decoding
        lh2->raw_data[location].bits_sweep = _demodulate_light(_lh2_vars.data[location].buffer);
        // figure out which polynomial each one of the two samples come from.
        lh2->raw_data[location].selected_polynomial = _determine_polynomial(lh2->raw_data[location].bits_sweep, &lh2->raw_data[location].bit_offset);
    }

