DotBots/DotBot-firmware/bsp/nrf52833/lh2.c
    if ((lh2->raw_data[0].selected_polynomial == LH2_POLYNOMIAL_ERROR_INDICATOR) ||
        (lh2->raw_data[1].selected_polynomial == LH2_POLYNOMIAL_ERROR_INDICATOR) ||
        (lh2->raw_data[2].selected_polynomial == LH2_POLYNOMIAL_ERROR_INDICATOR) ||
        (lh2->raw_data[3].selected_polynomial == LH2_POLYNOMIAL_ERROR_INDICATOR)) {  // failure to find one of the two polynomials - start from scratch and grab another capture
        db_lh2_reset(lh2);
        return;
    }

    for (uint8_t location = 0; location < LH2_LOCATIONS_COUNT; location++) {
        if ((lh2->raw_data[location].selected_polynomial == 0) || (lh2->raw_data[location].selected_polynomial == 1)) {
            _lh2_vars.lha_packet_counter++;  // from LHA
        }
        if ((lh2->raw_data[location].selected_polynomial == 2) || (lh2->raw_data[location].selected_polynomial == 3)) {
            _lh2_vars.lhb_packet_counter++;  // from LHB
        }
    }

    if ((_lh2_vars.lha_packet_counter == 1) || (_lh2_vars.lhb_packet_counter == 1)) {
        db_lh2_reset(lh2);
        return;  // odd # of packets from 1 LH, erroneous result
    }

    lh2->state = DB_LH2_RAW_DATA_READY;
}

void db_lh2_process_location(db_lh2_t *lh2) {
    if (lh2->state != DB_LH2_RAW_DATA_READY) {
        return;
    }

    // compute LFSR locations and detect invalid packets
    for (uint8_t location = 0; location < LH2_LOCATIONS_COUNT; location++) {
        lh2->locations[location].selected_polynomial = lh2->raw_data[location].selected_polynomial;
        // find location of the first data set by counting the LFSR backwards
        lh2->locations[location].lfsr_location = _reverse_count_p(
                                                     lh2->raw_data[location].selected_polynomial,
                                                     lh2->raw_data[location].bits_sweep >> (47 - lh2->raw_data[location].bit_offset)) -
                                                 lh2->raw_data[location].bit_offset;
    }

    uint32_t tmp_locations[LH2_LOCATIONS_COUNT] = { 0 };
    for (uint8_t location = 0; location < LH2_LOCATIONS_COUNT; location++) {
        tmp_locations[location] = lh2->locations[location].lfsr_location;
    }

    // results from 2 LH2 were discovered - sort the two pairs
    if (lh2->locations[0].lfsr_location > lh2->locations[1].lfsr_location) {
        lh2->locations[0].selected_polynomial = lh2->raw_data[1].selected_polynomial;
        lh2->locations[0].lfsr_location       = tmp_locations[1];
        lh2->locations[1].selected_polynomial = lh2->raw_data[0].selected_polynomial;
        lh2->locations[1].lfsr_location       = tmp_locations[0];
    }
    if (lh2->locations[2].lfsr_location > lh2->locations[3].lfsr_location) {
        lh2->locations[3].selected_polynomial = lh2->raw_data[2].selected_polynomial;
        lh2->locations[3].lfsr_location       = tmp_locations[2];
        lh2->locations[2].selected_polynomial = lh2->raw_data[3].selected_polynomial;
        lh2->locations[2].lfsr_location       = tmp_locations[3];
    }

    for (uint8_t location = 0; location < LH2_LOCATIONS_COUNT; location++) {
        memset(_lh2_vars.data[location].buffer, 0, LH2_BUFFER_SIZE);
    }
    lh2->state = DB_LH2_LOCATION_READY;
}

//=========================== private ==========================================

void _initialize_ts4231(const gpio_t *gpio_d, const gpio_t *gpio_e) {

    // Configure the wait timer
    db_timer_hf_init();

    // Filip's code define these pins as inputs, and then changes them quickly to outputs. Not sure why, but it works.
    _lh2_pin_set_input(gpio_d);
    _lh2_pin_set_input(gpio_e);

    // start the TS4231 initialization
    // Wiggle the Envelope and Data pins
    _lh2_pin_set_output(gpio_e);
    db_timer_hf_delay_us(10);
    nrf_port[gpio_e->port]->OUTSET = 1 << gpio_e->pin;  // set pin HIGH
    db_timer_hf_delay_us(10);
    nrf_port[gpio_e->port]->OUTCLR = 1 << gpio_e->pin;  // set pin LOW
    db_timer_hf_delay_us(10);
    nrf_port[gpio_e->port]->OUTSET = 1 << gpio_e->pin;
    db_timer_hf_delay_us(10);
    _lh2_pin_set_output(gpio_d);
    db_timer_hf_delay_us(10);
    nrf_port[gpio_d->port]->OUTSET = 1 << gpio_d->pin;
    db_timer_hf_delay_us(10);
    // Turn the pins back to inputs
    _lh2_pin_set_input(gpio_d);
    _lh2_pin_set_input(gpio_e);
    // finally, wait 1 milisecond
    db_timer_hf_delay_us(1000);

    // Send the configuration magic number/sequence
    uint16_t config_val = 0x392B;
    // Turn the Data and Envelope lines back to outputs and clear them.
    _lh2_pin_set_output(gpio_e);
    _lh2_pin_set_output(gpio_d);
    db_timer_hf_delay_us(10);
    nrf_port[gpio_d->port]->OUTCLR = 1 << gpio_d->pin;
    db_timer_hf_delay_us(10);
    nrf_port[gpio_e->port]->OUTCLR = 1 << gpio_e->pin;
    db_timer_hf_delay_us(10);
    // Send the magic configuration value, MSB first.
    for (uint8_t i = 0; i < 15; i++) {

        config_val = config_val << 1;
        if ((config_val & 0x8000) > 0) {
            nrf_port[gpio_d->port]->OUTSET = 1 << gpio_d->pin;
        } else {
            nrf_port[gpio_d->port]->OUTCLR = 1 << gpio_d->pin;
        }

        // Toggle the Envelope line as a clock.
        db_timer_hf_delay_us(10);
        nrf_port[gpio_e->port]->OUTSET = 1 << gpio_e->pin;
        db_timer_hf_delay_us(10);
        nrf_port[gpio_e->port]->OUTCLR = 1 << gpio_e->pin;
        db_timer_hf_delay_us(10);
    }
    // Finish send sequence and turn pins into inputs again.
    nrf_port[gpio_d->port]->OUTCLR = 1 << gpio_d->pin;
    db_timer_hf_delay_us(10);
    nrf_port[gpio_e->port]->OUTSET = 1 << gpio_e->pin;
    db_timer_hf_delay_us(10);
    nrf_port[gpio_d->port]->OUTSET = 1 << gpio_d->pin;
    db_timer_hf_delay_us(10);
    _lh2_pin_set_input(gpio_d);
    _lh2_pin_set_input(gpio_e);
    // Finish by waiting 10usec
    db_timer_hf_delay_us(10);

    // Now read back the sequence that the TS4231 answers.
    _lh2_pin_set_output(gpio_e);
    _lh2_pin_set_output(gpio_d);
    db_timer_hf_delay_us(10);
    nrf_port[gpio_d->port]->OUTCLR = 1 << gpio_d->pin;
    db_timer_hf_delay_us(10);
    nrf_port[gpio_e->port]->OUTCLR = 1 << gpio_e->pin;
    db_timer_hf_delay_us(10);
    nrf_port[gpio_d->port]->OUTSET = 1 << gpio_d->pin;
    db_timer_hf_delay_us(10);
    nrf_port[gpio_e->port]->OUTSET = 1 << gpio_e->pin;
    db_timer_hf_delay_us(10);
    // Set Data pin as an input, to receive the data
    _lh2_pin_set_input(gpio_d);
    db_timer_hf_delay_us(10);
    nrf_port[gpio_e->port]->OUTCLR = 1 << gpio_e->pin;
    db_timer_hf_delay_us(10);
    // Use the Envelope pin to output a clock while the data arrives.
    for (uint8_t i = 0; i < 14; i++) {
        nrf_port[gpio_e->port]->OUTSET = 1 << gpio_e->pin;
        db_timer_hf_delay_us(10);
        nrf_port[gpio_e->port]->OUTCLR = 1 << gpio_e->pin;
        db_timer_hf_delay_us(10);
    }

    // Finish the configuration procedure
    _lh2_pin_set_output(gpio_d);
    db_timer_hf_delay_us(10);
    nrf_port[gpio_e->port]->OUTSET = 1 << gpio_e->pin;
    db_timer_hf_delay_us(10);
    nrf_port[gpio_d->port]->OUTSET = 1 << gpio_d->pin;
    db_timer_hf_delay_us(10);

    nrf_port[gpio_e->port]->OUTCLR = 1 << gpio_e->pin;
    db_timer_hf_delay_us(10);
    nrf_port[gpio_d->port]->OUTCLR = 1 << gpio_d->pin;
    db_timer_hf_delay_us(10);
    nrf_port[gpio_e->port]->OUTSET = 1 << gpio_e->pin;
    db_timer_hf_delay_us(10);

    _lh2_pin_set_input(gpio_d);
    _lh2_pin_set_input(gpio_e);

    db_timer_hf_delay_us(50000);
}

uint64_t _demodulate_light(uint8_t *sample_buffer) {  // bad input variable name!!
    // TODO: rename sample_buffer
    // TODO: make it a void and have chips be a modified pointer thingie
    // FIXME: there is an edge case where I throw away an initial "1" and do not count it in the bit-shift offset, resulting in an incorrect error of 1 in the LFSR location
    uint8_t chip_index;
    uint8_t local_buffer[128];
    uint8_t zccs_1[128];
    uint8_t chips1[128];  // TODO: give this a better name.
    uint8_t temp_byte_N;  // TODO: bad variable name "temp byte"
    uint8_t temp_byte_M;  // TODO: bad variable name "temp byte"

